var hotCities = [{
		        "name": "北京",
		        "code": "00110001"
		    }, {
		        "name": "上海",
		        "code": "00310000"
		    }, {
		        "name": "深圳",
		        "code": "00440000"
		    }, {
		        "name": "南京",
		        "code": "00320004"
		    }, {
		        "name": "杭州",
		        "code": "00330000"
		    }, {
		        "name": "重庆",
		        "code": "00500000"
		    }

		];
		var cities = {
		    "B": [{
		            "name": "北京",
		            "code": "00110001"
		        },
		        {
		            "name": "包头",
		            "code": "00150000"
		        },
		        {
		            "name": "保定",
		            "code": "00130005"
		        }
		    ],
		    "C": [{
		            "name": "成都",
		            "code": "00510001"
		        },
		        {
		            "name": "重庆",
		            "code": "00500000"
		        }
		    ],
		    "D": [{
		            "name": "大连",
		            "code": "00210003"
		        },
		        {
		            "name": "东莞",
		            "code": "00440002"
		        }
		    ],
		    "G": [{
		        "name": "广州",
		        "code": "00440001"
		    }],
		    "H": [{
		            "name": "杭州",
		            "code": "00330000"
		        },
		        {
		            "name": "海南",
		            "code": "00310000"
		        },
		        {
		            "name": "哈尔滨",
		            "code": "00230006"
		        },
		        {
		            "name": "邯郸",
		            "code": "00130007"
		        }
		    ],
		    "J": [{
		            "name": "济南",
		            "code": "00370002"
		        },
		        {
		            "name": "吉林",
		            "code": "00220002"
		        }
		    ],
		    "N": [{
		            "name": "南京",
		            "code": "00320004"
		        },
		        {
		            "name": "宁波",
		            "code": "00330001"
		        }
		    ],
		    "Q": [{
		            "name": "青岛",
		            "code": "00370001"
		        },
		        {
		            "name": "秦皇岛",
		            "code": "00130001"
		        }
		    ],
		    "S": [{
		            "name": "上海",
		            "code": "00310000"
		        },
		        {
		            "name": "深圳",
		            "code": "00440000"
		        },
		        {
		            "name": "石家庄",
		            "code": "00130004"
		        },
		        {
		            "name": "上饶",
		            "code": "00360004"
		        },
		        {
		            "name": "汕头",
		            "code": "00440008"
		        }
		    ],
		    "T": [{
		            "name": "天津",
		            "code": "00310000"
		        },
		        {
		            "name": "太原",
		            "code": "00140000"
		        }
		    ],
		    "W": [{
		        "name": "武汉",
		        "code": "00420019"
		    }],
		    "X": [{
		            "name": "西安",
		            "code": "00610003"
		        },
		        {
		            "name": "厦门",
		            "code": "00350001"
		        }
		    ],
		    "Y": [{
		            "name": "烟台",
		            "code": "00370003"
		        },
		        {
		            "name": "扬州",
		            "code": "00320003"
		        }
		    ]
		};